{"keras_version": "1.2.0", "class_name": "Sequential", "config": [{"class_name": "InputLayer", "config": {"sparse": false, "input_dtype": "float32", "batch_input_shape": [null, 50, 160, 3], "name": "input_1"}}, {"class_name": "Convolution2D", "config": {"bias": true, "W_constraint": null, "b_regularizer": null, "W_regularizer": null, "nb_filter": 16, "nb_row": 3, "activation": "relu", "activity_regularizer": null, "init": "glorot_uniform", "name": "conv1", "nb_col": 3, "subsample": [2, 2], "b_constraint": null, "trainable": true, "dim_ordering": "tf", "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"bias": true, "W_constraint": null, "b_regularizer": null, "W_regularizer": null, "nb_filter": 32, "nb_row": 3, "activation": "relu", "activity_regularizer": null, "init": "glorot_uniform", "name": "conv2", "nb_col": 3, "subsample": [2, 2], "b_constraint": null, "trainable": true, "dim_ordering": "tf", "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"bias": true, "W_constraint": null, "b_regularizer": null, "W_regularizer": null, "nb_filter": 8, "nb_row": 5, "activation": "relu", "activity_regularizer": null, "init": "glorot_uniform", "name": "conv3", "nb_col": 5, "subsample": [1, 1], "b_constraint": null, "trainable": true, "dim_ordering": "tf", "border_mode": "valid"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [4, 4], "strides": [4, 4], "name": "maxpool2", "dim_ordering": "tf", "border_mode": "valid", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"input_dtype": "float32", "output_dim": 20, "bias": true, "b_regularizer": null, "W_regularizer": null, "W_constraint": null, "activation": "sigmoid", "trainable": true, "init": "glorot_uniform", "batch_input_shape": [null, 64], "input_dim": 64, "name": "dense20", "b_constraint": null, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout", "p": 0.5}}, {"class_name": "Dense", "config": {"input_dtype": "float32", "output_dim": 20, "bias": true, "b_regularizer": null, "W_regularizer": null, "W_constraint": null, "activation": "sigmoid", "trainable": true, "init": "glorot_uniform", "batch_input_shape": [null, 20], "input_dim": 20, "name": "dense10", "b_constraint": null, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"input_dtype": "float32", "output_dim": 1, "bias": true, "b_regularizer": null, "W_regularizer": null, "W_constraint": null, "activation": "linear", "trainable": true, "init": "glorot_uniform", "batch_input_shape": [null, 20], "input_dim": 20, "name": "final", "b_constraint": null, "activity_regularizer": null}}]}