{"keras_version": "1.2.0", "config": [{"config": {"batch_input_shape": [null, 50, 160, 3], "sparse": false, "input_dtype": "float32", "name": "input_1"}, "class_name": "InputLayer"}, {"config": {"nb_row": 3, "nb_filter": 16, "trainable": true, "init": "glorot_uniform", "W_constraint": null, "nb_col": 3, "b_regularizer": null, "activation": "relu", "border_mode": "valid", "W_regularizer": null, "subsample": [2, 2], "dim_ordering": "tf", "activity_regularizer": null, "b_constraint": null, "bias": true, "name": "conv1"}, "class_name": "Convolution2D"}, {"config": {"nb_row": 3, "nb_filter": 32, "trainable": true, "init": "glorot_uniform", "W_constraint": null, "nb_col": 3, "b_regularizer": null, "activation": "relu", "border_mode": "valid", "W_regularizer": null, "subsample": [2, 2], "dim_ordering": "tf", "activity_regularizer": null, "b_constraint": null, "bias": true, "name": "conv2"}, "class_name": "Convolution2D"}, {"config": {"nb_row": 5, "nb_filter": 8, "trainable": true, "init": "glorot_uniform", "W_constraint": null, "nb_col": 5, "b_regularizer": null, "activation": "relu", "border_mode": "valid", "W_regularizer": null, "subsample": [1, 1], "dim_ordering": "tf", "activity_regularizer": null, "b_constraint": null, "bias": true, "name": "conv3"}, "class_name": "Convolution2D"}, {"config": {"border_mode": "valid", "trainable": true, "dim_ordering": "tf", "strides": [4, 4], "name": "maxpool2", "pool_size": [4, 4]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"batch_input_shape": [null, 64], "b_regularizer": null, "input_dtype": "float32", "init": "glorot_uniform", "W_constraint": null, "name": "dense20", "activation": "tanh", "input_dim": 64, "output_dim": 20, "W_regularizer": null, "trainable": true, "bias": true, "activity_regularizer": null, "b_constraint": null}, "class_name": "Dense"}, {"config": {"p": 0.5, "trainable": true, "name": "dropout"}, "class_name": "Dropout"}, {"config": {"batch_input_shape": [null, 20], "b_regularizer": null, "input_dtype": "float32", "init": "glorot_uniform", "W_constraint": null, "name": "dense10", "activation": "tanh", "input_dim": 20, "output_dim": 20, "W_regularizer": null, "trainable": true, "bias": true, "activity_regularizer": null, "b_constraint": null}, "class_name": "Dense"}, {"config": {"batch_input_shape": [null, 20], "b_regularizer": null, "input_dtype": "float32", "init": "glorot_uniform", "W_constraint": null, "name": "final", "activation": "linear", "input_dim": 20, "output_dim": 1, "W_regularizer": null, "trainable": true, "bias": true, "activity_regularizer": null, "b_constraint": null}, "class_name": "Dense"}], "class_name": "Sequential"}