{"keras_version": "1.2.0", "class_name": "Sequential", "config": [{"class_name": "InputLayer", "config": {"sparse": false, "input_dtype": "float32", "batch_input_shape": [null, 50, 160, 3], "name": "input_1"}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "trainable": true, "nb_col": 3, "init": "glorot_uniform", "b_constraint": null, "subsample": [2, 2], "b_regularizer": null, "nb_row": 3, "W_constraint": null, "nb_filter": 16, "border_mode": "valid", "activity_regularizer": null, "name": "conv1", "bias": true, "dim_ordering": "tf", "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "trainable": true, "nb_col": 3, "init": "glorot_uniform", "b_constraint": null, "subsample": [2, 2], "b_regularizer": null, "nb_row": 3, "W_constraint": null, "nb_filter": 32, "border_mode": "valid", "activity_regularizer": null, "name": "conv2", "bias": true, "dim_ordering": "tf", "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "trainable": true, "nb_col": 5, "init": "glorot_uniform", "b_constraint": null, "subsample": [1, 1], "b_regularizer": null, "nb_row": 5, "W_constraint": null, "nb_filter": 8, "border_mode": "valid", "activity_regularizer": null, "name": "conv3", "bias": true, "dim_ordering": "tf", "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [4, 4], "trainable": true, "border_mode": "valid", "dim_ordering": "tf", "name": "maxpool2", "strides": [4, 4]}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"output_dim": 20, "trainable": true, "batch_input_shape": [null, 64], "b_constraint": null, "W_regularizer": null, "name": "dense20", "b_regularizer": null, "W_constraint": null, "input_dtype": "float32", "input_dim": 64, "init": "glorot_uniform", "bias": true, "activity_regularizer": null, "activation": "tanh"}}, {"class_name": "Dropout", "config": {"name": "dropout", "trainable": true, "p": 0.5}}, {"class_name": "Dense", "config": {"output_dim": 20, "trainable": true, "batch_input_shape": [null, 20], "b_constraint": null, "W_regularizer": null, "name": "dense10", "b_regularizer": null, "W_constraint": null, "input_dtype": "float32", "input_dim": 20, "init": "glorot_uniform", "bias": true, "activity_regularizer": null, "activation": "tanh"}}, {"class_name": "Dense", "config": {"output_dim": 1, "trainable": true, "batch_input_shape": [null, 20], "b_constraint": null, "W_regularizer": null, "name": "final", "b_regularizer": null, "W_constraint": null, "input_dtype": "float32", "input_dim": 20, "init": "glorot_uniform", "bias": true, "activity_regularizer": null, "activation": "linear"}}]}