{"config": [{"config": {"input_dtype": "float32", "name": "input_1", "sparse": false, "batch_input_shape": [null, 50, 160, 3]}, "class_name": "InputLayer"}, {"config": {"name": "conv1", "init": "glorot_uniform", "depthwise_constraint": null, "subsample": [2, 2], "depth_multiplier": 1, "border_mode": "valid", "dim_ordering": "tf", "pointwise_constraint": null, "trainable": true, "b_constraint": null, "bias": true, "nb_row": 3, "depthwise_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "pointwise_regularizer": null, "activation": "relu", "nb_col": 3, "nb_filter": 16}, "class_name": "SeparableConvolution2D"}, {"config": {"bias": true, "init": "glorot_uniform", "W_constraint": null, "border_mode": "valid", "dim_ordering": "tf", "subsample": [2, 2], "trainable": true, "b_constraint": null, "activation": "relu", "nb_row": 3, "W_regularizer": null, "b_regularizer": null, "name": "conv2", "activity_regularizer": null, "nb_col": 3, "nb_filter": 32}, "class_name": "Convolution2D"}, {"config": {"bias": true, "init": "glorot_uniform", "W_constraint": null, "border_mode": "valid", "dim_ordering": "tf", "subsample": [1, 1], "trainable": true, "b_constraint": null, "activation": "relu", "nb_row": 5, "W_regularizer": null, "b_regularizer": null, "name": "conv3", "activity_regularizer": null, "nb_col": 5, "nb_filter": 8}, "class_name": "Convolution2D"}, {"config": {"pool_size": [4, 4], "border_mode": "valid", "name": "maxpool2", "dim_ordering": "tf", "strides": [4, 4], "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"init": "glorot_uniform", "input_dim": 64, "name": "dense20", "W_constraint": null, "trainable": true, "b_constraint": null, "activation": "sigmoid", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "output_dim": 20, "bias": true}, "class_name": "Dense"}, {"config": {"name": "dropout", "p": 0.5, "trainable": true}, "class_name": "Dropout"}, {"config": {"init": "glorot_uniform", "input_dim": 20, "name": "dense10", "W_constraint": null, "trainable": true, "b_constraint": null, "activation": "sigmoid", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "output_dim": 20, "bias": true}, "class_name": "Dense"}, {"config": {"init": "glorot_uniform", "input_dim": 20, "name": "final", "W_constraint": null, "trainable": true, "b_constraint": null, "activation": "linear", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "output_dim": 1, "bias": true}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.2.0"}