{"class_name": "Sequential", "keras_version": "1.2.0", "config": [{"class_name": "InputLayer", "config": {"sparse": false, "input_dtype": "float32", "batch_input_shape": [null, 55, 160, 3], "name": "input_2"}}, {"class_name": "SeparableConvolution2D", "config": {"b_regularizer": null, "depthwise_regularizer": null, "nb_filter": 16, "depth_multiplier": 1, "subsample": [2, 2], "dim_ordering": "tf", "nb_row": 3, "pointwise_regularizer": null, "border_mode": "valid", "name": "conv1", "depthwise_constraint": null, "b_constraint": null, "pointwise_constraint": null, "activity_regularizer": null, "trainable": true, "nb_col": 3, "init": "glorot_uniform", "bias": true, "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "nb_filter": 32, "dim_ordering": "tf", "nb_row": 3, "trainable": true, "border_mode": "valid", "init": "glorot_uniform", "name": "conv2", "W_constraint": null, "activation": "relu", "activity_regularizer": null, "W_regularizer": null, "nb_col": 3, "b_regularizer": null, "bias": true, "subsample": [2, 2]}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "nb_filter": 64, "dim_ordering": "tf", "nb_row": 5, "trainable": true, "border_mode": "valid", "init": "glorot_uniform", "name": "conv3", "W_constraint": null, "activation": "relu", "activity_regularizer": null, "W_regularizer": null, "nb_col": 5, "b_regularizer": null, "bias": true, "subsample": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"border_mode": "valid", "strides": [4, 4], "name": "maxpool2", "pool_size": [4, 4], "dim_ordering": "tf", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_2", "trainable": true}}, {"class_name": "Dense", "config": {"b_regularizer": null, "W_constraint": null, "output_dim": 100, "input_dim": 1024, "trainable": true, "activity_regularizer": null, "b_constraint": null, "name": "dense100", "W_regularizer": null, "init": "glorot_uniform", "bias": true, "activation": "sigmoid"}}, {"class_name": "Dense", "config": {"b_regularizer": null, "W_constraint": null, "output_dim": 20, "input_dim": 100, "trainable": true, "activity_regularizer": null, "b_constraint": null, "name": "dense20", "W_regularizer": null, "init": "glorot_uniform", "bias": true, "activation": "sigmoid"}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout", "trainable": true}}, {"class_name": "Dense", "config": {"b_regularizer": null, "W_constraint": null, "output_dim": 10, "input_dim": 20, "trainable": true, "activity_regularizer": null, "b_constraint": null, "name": "dense10", "W_regularizer": null, "init": "glorot_uniform", "bias": true, "activation": "sigmoid"}}, {"class_name": "Dense", "config": {"b_regularizer": null, "W_constraint": null, "output_dim": 1, "input_dim": 10, "trainable": true, "activity_regularizer": null, "b_constraint": null, "name": "final", "W_regularizer": null, "init": "glorot_uniform", "bias": true, "activation": "linear"}}]}