{"keras_version": "1.2.0", "config": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 80, 160, 3], "sparse": false, "input_dtype": "float32", "name": "input_5"}}, {"class_name": "SeparableConvolution2D", "config": {"border_mode": "valid", "nb_col": 3, "activity_regularizer": null, "trainable": true, "nb_row": 3, "dim_ordering": "tf", "b_constraint": null, "init": "glorot_uniform", "depthwise_constraint": null, "pointwise_constraint": null, "depthwise_regularizer": null, "bias": true, "pointwise_regularizer": null, "name": "conv1", "subsample": [2, 2], "activation": "relu", "nb_filter": 16, "b_regularizer": null, "depth_multiplier": 1}}, {"class_name": "Convolution2D", "config": {"nb_col": 3, "activity_regularizer": null, "trainable": true, "W_constraint": null, "nb_row": 3, "dim_ordering": "tf", "b_constraint": null, "b_regularizer": null, "bias": true, "name": "conv2", "nb_filter": 32, "activation": "relu", "subsample": [2, 2], "init": "glorot_uniform", "border_mode": "valid", "W_regularizer": null}}, {"class_name": "Convolution2D", "config": {"nb_col": 5, "activity_regularizer": null, "trainable": true, "W_constraint": null, "nb_row": 5, "dim_ordering": "tf", "b_constraint": null, "b_regularizer": null, "bias": true, "name": "conv3", "nb_filter": 8, "activation": "relu", "subsample": [1, 1], "init": "glorot_uniform", "border_mode": "valid", "W_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpool2", "trainable": true, "pool_size": [4, 4], "border_mode": "valid", "dim_ordering": "tf", "strides": [4, 4]}}, {"class_name": "Flatten", "config": {"name": "flatten_8", "trainable": true}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "trainable": true, "W_constraint": null, "output_dim": 20, "b_constraint": null, "init": "glorot_uniform", "bias": true, "name": "dense1", "activation": "sigmoid", "input_dim": 192, "b_regularizer": null, "W_regularizer": null}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout", "trainable": true}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "trainable": true, "W_constraint": null, "output_dim": 20, "b_constraint": null, "init": "glorot_uniform", "bias": true, "name": "dense2", "activation": "sigmoid", "input_dim": 20, "b_regularizer": null, "W_regularizer": null}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "trainable": true, "W_constraint": null, "output_dim": 1, "b_constraint": null, "init": "glorot_uniform", "bias": true, "name": "final", "activation": "linear", "input_dim": 20, "b_regularizer": null, "W_regularizer": null}}], "class_name": "Sequential"}