{"keras_version": "1.2.0", "class_name": "Sequential", "config": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 80, 160, 3], "sparse": false, "input_dtype": "float32", "name": "input_1"}}, {"class_name": "SeparableConvolution2D", "config": {"init": "glorot_uniform", "nb_row": 3, "depthwise_regularizer": null, "pointwise_constraint": null, "pointwise_regularizer": null, "nb_filter": 16, "depth_multiplier": 1, "activity_regularizer": null, "name": "conv1", "subsample": [2, 2], "activation": "relu", "nb_col": 3, "depthwise_constraint": null, "border_mode": "valid", "bias": true, "dim_ordering": "tf", "b_constraint": null, "trainable": true, "b_regularizer": null}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "nb_row": 3, "W_constraint": null, "nb_filter": 32, "W_regularizer": null, "name": "conv2", "activity_regularizer": null, "subsample": [2, 2], "activation": "relu", "nb_col": 3, "border_mode": "valid", "bias": true, "dim_ordering": "tf", "b_constraint": null, "trainable": true, "b_regularizer": null}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "nb_row": 5, "W_constraint": null, "nb_filter": 64, "W_regularizer": null, "name": "conv3", "activity_regularizer": null, "subsample": [1, 1], "activation": "relu", "nb_col": 5, "border_mode": "valid", "bias": true, "dim_ordering": "tf", "b_constraint": null, "trainable": true, "b_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "border_mode": "valid", "dim_ordering": "tf", "pool_size": [4, 4], "name": "maxpool2", "strides": [4, 4]}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "input_dim": 1536, "W_constraint": null, "name": "dense100", "activity_regularizer": null, "activation": "sigmoid", "W_regularizer": null, "bias": true, "output_dim": 100, "b_constraint": null, "trainable": true, "b_regularizer": null}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "input_dim": 100, "W_constraint": null, "name": "dense20", "activity_regularizer": null, "activation": "sigmoid", "W_regularizer": null, "bias": true, "output_dim": 20, "b_constraint": null, "trainable": true, "b_regularizer": null}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout", "trainable": true}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "input_dim": 20, "W_constraint": null, "name": "dense10", "activity_regularizer": null, "activation": "sigmoid", "W_regularizer": null, "bias": true, "output_dim": 10, "b_constraint": null, "trainable": true, "b_regularizer": null}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "input_dim": 10, "W_constraint": null, "name": "final", "activity_regularizer": null, "activation": "linear", "W_regularizer": null, "bias": true, "output_dim": 1, "b_constraint": null, "trainable": true, "b_regularizer": null}}]}