{"config": [{"config": {"batch_input_shape": [null, 80, 160, 3], "input_dtype": "float32", "sparse": false, "name": "input_2"}, "class_name": "InputLayer"}, {"config": {"border_mode": "valid", "activity_regularizer": null, "name": "conv1", "subsample": [2, 2], "trainable": true, "dim_ordering": "tf", "nb_filter": 16, "depthwise_constraint": null, "b_constraint": null, "bias": true, "init": "glorot_uniform", "pointwise_regularizer": null, "nb_col": 3, "nb_row": 3, "activation": "relu", "depth_multiplier": 1, "depthwise_regularizer": null, "pointwise_constraint": null, "b_regularizer": null}, "class_name": "SeparableConvolution2D"}, {"config": {"border_mode": "valid", "activity_regularizer": null, "name": "conv2", "subsample": [2, 2], "trainable": true, "dim_ordering": "tf", "nb_filter": 32, "b_constraint": null, "bias": true, "W_regularizer": null, "init": "glorot_uniform", "nb_col": 3, "nb_row": 3, "activation": "relu", "W_constraint": null, "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"border_mode": "valid", "activity_regularizer": null, "name": "conv3", "subsample": [1, 1], "trainable": true, "dim_ordering": "tf", "nb_filter": 64, "b_constraint": null, "bias": true, "W_regularizer": null, "init": "glorot_uniform", "nb_col": 5, "nb_row": 5, "activation": "relu", "W_constraint": null, "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"border_mode": "valid", "name": "maxpool2", "trainable": true, "dim_ordering": "tf", "strides": [4, 4], "pool_size": [4, 4]}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_2", "trainable": true}, "class_name": "Flatten"}, {"config": {"activity_regularizer": null, "name": "dense100", "trainable": true, "b_constraint": null, "bias": true, "W_regularizer": null, "init": "glorot_uniform", "input_dim": 1536, "output_dim": 100, "activation": "sigmoid", "W_constraint": null, "b_regularizer": null}, "class_name": "Dense"}, {"config": {"activity_regularizer": null, "name": "dense20", "trainable": true, "b_constraint": null, "bias": true, "W_regularizer": null, "init": "glorot_uniform", "input_dim": 100, "output_dim": 20, "activation": "sigmoid", "W_constraint": null, "b_regularizer": null}, "class_name": "Dense"}, {"config": {"p": 0.5, "name": "dropout", "trainable": true}, "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "name": "dense10", "trainable": true, "b_constraint": null, "bias": true, "W_regularizer": null, "init": "glorot_uniform", "input_dim": 20, "output_dim": 10, "activation": "sigmoid", "W_constraint": null, "b_regularizer": null}, "class_name": "Dense"}, {"config": {"activity_regularizer": null, "name": "final", "trainable": true, "b_constraint": null, "bias": true, "W_regularizer": null, "init": "glorot_uniform", "input_dim": 10, "output_dim": 1, "activation": "linear", "W_constraint": null, "b_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.2.0"}