{"keras_version": "1.2.0", "class_name": "Sequential", "config": [{"class_name": "InputLayer", "config": {"name": "input_1", "batch_input_shape": [null, 50, 160, 3], "input_dtype": "float32", "sparse": false}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "subsample": [2, 2], "bias": true, "nb_col": 3, "b_constraint": null, "nb_filter": 16, "border_mode": "valid", "trainable": true, "W_regularizer": null, "name": "conv1", "b_regularizer": null, "W_constraint": null, "activation": "relu", "dim_ordering": "tf", "nb_row": 3, "activity_regularizer": null}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "subsample": [2, 2], "bias": true, "nb_col": 3, "b_constraint": null, "nb_filter": 32, "border_mode": "valid", "trainable": true, "W_regularizer": null, "name": "conv2", "b_regularizer": null, "W_constraint": null, "activation": "relu", "dim_ordering": "tf", "nb_row": 3, "activity_regularizer": null}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "subsample": [1, 1], "bias": true, "nb_col": 5, "b_constraint": null, "nb_filter": 8, "border_mode": "valid", "trainable": true, "W_regularizer": null, "name": "conv3", "b_regularizer": null, "W_constraint": null, "activation": "relu", "dim_ordering": "tf", "nb_row": 5, "activity_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpool2", "trainable": true, "pool_size": [4, 4], "dim_ordering": "tf", "border_mode": "valid", "strides": [4, 4]}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "bias": true, "b_constraint": null, "b_regularizer": null, "trainable": true, "output_dim": 20, "W_regularizer": null, "name": "dense20", "input_dtype": "float32", "input_dim": 64, "W_constraint": null, "activation": "tanh", "activity_regularizer": null, "batch_input_shape": [null, 64]}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout", "p": 0.5}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "bias": true, "b_constraint": null, "b_regularizer": null, "trainable": true, "output_dim": 20, "W_regularizer": null, "name": "dense10", "input_dtype": "float32", "input_dim": 20, "W_constraint": null, "activation": "tanh", "activity_regularizer": null, "batch_input_shape": [null, 20]}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "bias": true, "b_constraint": null, "b_regularizer": null, "trainable": true, "output_dim": 1, "W_regularizer": null, "name": "final", "input_dtype": "float32", "input_dim": 20, "W_constraint": null, "activation": "linear", "activity_regularizer": null, "batch_input_shape": [null, 20]}}]}