{"class_name": "Sequential", "config": [{"class_name": "InputLayer", "config": {"input_dtype": "float32", "name": "input_4", "batch_input_shape": [null, 160, 320, 3], "sparse": false}}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "nb_filter": 8, "bias": true, "init": "glorot_uniform", "b_constraint": null, "activity_regularizer": null, "subsample": [1, 1], "activation": "relu", "nb_col": 3, "W_constraint": null, "name": "conv1", "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "border_mode": "valid", "trainable": true}}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "nb_filter": 8, "bias": true, "init": "glorot_uniform", "b_constraint": null, "activity_regularizer": null, "subsample": [1, 1], "activation": "relu", "nb_col": 3, "W_constraint": null, "name": "conv2", "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "border_mode": "valid", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "border_mode": "valid", "name": "maxpool1", "dim_ordering": "tf", "pool_size": [2, 2], "strides": [2, 2]}}, {"class_name": "Convolution2D", "config": {"nb_row": 5, "nb_filter": 8, "bias": true, "init": "glorot_uniform", "b_constraint": null, "activity_regularizer": null, "subsample": [1, 1], "activation": "relu", "nb_col": 5, "W_constraint": null, "name": "conv3", "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "border_mode": "valid", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "border_mode": "valid", "name": "maxpool2", "dim_ordering": "tf", "pool_size": [4, 4], "strides": [4, 4]}}, {"class_name": "Flatten", "config": {"name": "flatten_5", "trainable": true}}, {"class_name": "Dense", "config": {"bias": true, "init": "glorot_uniform", "b_constraint": null, "activity_regularizer": null, "input_dim": 5472, "activation": "sigmoid", "W_constraint": null, "output_dim": 20, "name": "dense1", "W_regularizer": null, "b_regularizer": null, "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout", "p": 0.5, "trainable": true}}, {"class_name": "Dense", "config": {"bias": true, "init": "glorot_uniform", "b_constraint": null, "activity_regularizer": null, "input_dim": 20, "activation": "sigmoid", "W_constraint": null, "output_dim": 20, "name": "dense2", "W_regularizer": null, "b_regularizer": null, "trainable": true}}, {"class_name": "Dense", "config": {"bias": true, "init": "glorot_uniform", "b_constraint": null, "activity_regularizer": null, "input_dim": 20, "activation": "linear", "W_constraint": null, "output_dim": 1, "name": "final", "W_regularizer": null, "b_regularizer": null, "trainable": true}}], "keras_version": "1.2.0"}