{"class_name": "Sequential", "config": [{"class_name": "InputLayer", "config": {"input_dtype": "float32", "batch_input_shape": [null, 50, 160, 3], "name": "input_1", "sparse": false}}, {"class_name": "Convolution2D", "config": {"border_mode": "valid", "init": "glorot_uniform", "nb_filter": 16, "activation": "relu", "nb_col": 3, "name": "conv1", "bias": true, "b_constraint": null, "trainable": true, "dim_ordering": "tf", "activity_regularizer": null, "nb_row": 3, "W_constraint": null, "b_regularizer": null, "W_regularizer": null, "subsample": [2, 2]}}, {"class_name": "Convolution2D", "config": {"border_mode": "valid", "init": "glorot_uniform", "nb_filter": 32, "activation": "relu", "nb_col": 3, "name": "conv2", "bias": true, "b_constraint": null, "trainable": true, "dim_ordering": "tf", "activity_regularizer": null, "nb_row": 3, "W_constraint": null, "b_regularizer": null, "W_regularizer": null, "subsample": [2, 2]}}, {"class_name": "Convolution2D", "config": {"border_mode": "valid", "init": "glorot_uniform", "nb_filter": 8, "activation": "relu", "nb_col": 5, "name": "conv3", "bias": true, "b_constraint": null, "trainable": true, "dim_ordering": "tf", "activity_regularizer": null, "nb_row": 5, "W_constraint": null, "b_regularizer": null, "W_regularizer": null, "subsample": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"border_mode": "valid", "dim_ordering": "tf", "pool_size": [4, 4], "strides": [4, 4], "name": "maxpool2", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "activation": "tanh", "output_dim": 20, "batch_input_shape": [null, 64], "bias": true, "activity_regularizer": null, "trainable": true, "input_dtype": "float32", "name": "dense20", "b_constraint": null, "input_dim": 64, "W_constraint": null, "b_regularizer": null, "W_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout", "p": 0.5, "trainable": true}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "activation": "tanh", "output_dim": 20, "batch_input_shape": [null, 20], "bias": true, "activity_regularizer": null, "trainable": true, "input_dtype": "float32", "name": "dense10", "b_constraint": null, "input_dim": 20, "W_constraint": null, "b_regularizer": null, "W_regularizer": null}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "activation": "linear", "output_dim": 1, "batch_input_shape": [null, 20], "bias": true, "activity_regularizer": null, "trainable": true, "input_dtype": "float32", "name": "final", "b_constraint": null, "input_dim": 20, "W_constraint": null, "b_regularizer": null, "W_regularizer": null}}], "keras_version": "1.2.0"}