{"keras_version": "1.2.0", "config": [{"config": {"batch_input_shape": [null, 80, 160, 3], "name": "input_1", "input_dtype": "float32", "sparse": false}, "class_name": "InputLayer"}, {"config": {"depth_multiplier": 1, "dim_ordering": "tf", "b_regularizer": null, "bias": true, "nb_row": 3, "trainable": true, "pointwise_constraint": null, "activity_regularizer": null, "depthwise_regularizer": null, "b_constraint": null, "name": "conv1", "nb_filter": 16, "pointwise_regularizer": null, "border_mode": "valid", "depthwise_constraint": null, "activation": "relu", "init": "glorot_uniform", "subsample": [2, 2], "nb_col": 3}, "class_name": "SeparableConvolution2D"}, {"config": {"activity_regularizer": null, "dim_ordering": "tf", "b_regularizer": null, "nb_row": 3, "trainable": true, "bias": true, "b_constraint": null, "subsample": [2, 2], "nb_filter": 32, "border_mode": "valid", "name": "conv2", "activation": "relu", "init": "glorot_uniform", "W_constraint": null, "nb_col": 3, "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"activity_regularizer": null, "dim_ordering": "tf", "b_regularizer": null, "nb_row": 5, "trainable": true, "bias": true, "b_constraint": null, "subsample": [1, 1], "nb_filter": 64, "border_mode": "valid", "name": "conv3", "activation": "relu", "init": "glorot_uniform", "W_constraint": null, "nb_col": 5, "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"dim_ordering": "tf", "pool_size": [4, 4], "trainable": true, "name": "maxpool2", "strides": [4, 4], "border_mode": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"activity_regularizer": null, "bias": true, "b_regularizer": null, "trainable": true, "output_dim": 100, "input_dim": 1536, "name": "dense100", "activation": "sigmoid", "init": "glorot_uniform", "W_constraint": null, "b_constraint": null, "W_regularizer": null}, "class_name": "Dense"}, {"config": {"activity_regularizer": null, "bias": true, "b_regularizer": null, "trainable": true, "output_dim": 20, "input_dim": 100, "name": "dense20", "activation": "sigmoid", "init": "glorot_uniform", "W_constraint": null, "b_constraint": null, "W_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "dropout", "p": 0.5, "trainable": true}, "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "bias": true, "b_regularizer": null, "trainable": true, "output_dim": 10, "input_dim": 20, "name": "dense10", "activation": "sigmoid", "init": "glorot_uniform", "W_constraint": null, "b_constraint": null, "W_regularizer": null}, "class_name": "Dense"}, {"config": {"activity_regularizer": null, "bias": true, "b_regularizer": null, "trainable": true, "output_dim": 1, "input_dim": 10, "name": "final", "activation": "linear", "init": "glorot_uniform", "W_constraint": null, "b_constraint": null, "W_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential"}