{"config": [{"config": {"batch_input_shape": [null, 50, 160, 3], "sparse": false, "name": "input_1", "input_dtype": "float32"}, "class_name": "InputLayer"}, {"config": {"nb_row": 3, "nb_col": 3, "init": "glorot_uniform", "dim_ordering": "tf", "activation": "relu", "W_regularizer": null, "name": "conv1", "b_regularizer": null, "nb_filter": 16, "trainable": true, "bias": true, "activity_regularizer": null, "b_constraint": null, "subsample": [2, 2], "W_constraint": null, "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"nb_row": 3, "nb_col": 3, "init": "glorot_uniform", "dim_ordering": "tf", "activation": "relu", "W_regularizer": null, "name": "conv2", "b_regularizer": null, "nb_filter": 32, "trainable": true, "bias": true, "activity_regularizer": null, "b_constraint": null, "subsample": [2, 2], "W_constraint": null, "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"nb_row": 5, "nb_col": 5, "init": "glorot_uniform", "dim_ordering": "tf", "activation": "relu", "W_regularizer": null, "name": "conv3", "b_regularizer": null, "nb_filter": 8, "trainable": true, "bias": true, "activity_regularizer": null, "b_constraint": null, "subsample": [1, 1], "W_constraint": null, "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"name": "maxpool2", "border_mode": "valid", "pool_size": [4, 4], "strides": [4, 4], "dim_ordering": "tf", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"input_dim": 64, "output_dim": 20, "init": "glorot_uniform", "activation": "sigmoid", "W_regularizer": null, "input_dtype": "float32", "name": "dense20", "batch_input_shape": [null, 64], "b_regularizer": null, "trainable": true, "bias": true, "activity_regularizer": null, "b_constraint": null, "W_constraint": null}, "class_name": "Dense"}, {"config": {"name": "dropout", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"input_dim": 20, "output_dim": 20, "init": "glorot_uniform", "activation": "sigmoid", "W_regularizer": null, "input_dtype": "float32", "name": "dense10", "batch_input_shape": [null, 20], "b_regularizer": null, "trainable": true, "bias": true, "activity_regularizer": null, "b_constraint": null, "W_constraint": null}, "class_name": "Dense"}, {"config": {"input_dim": 20, "output_dim": 1, "init": "glorot_uniform", "activation": "linear", "W_regularizer": null, "input_dtype": "float32", "name": "final", "batch_input_shape": [null, 20], "b_regularizer": null, "trainable": true, "bias": true, "activity_regularizer": null, "b_constraint": null, "W_constraint": null}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.2.0"}