{"config": [{"config": {"input_dtype": "float32", "sparse": false, "batch_input_shape": [null, 50, 160, 3], "name": "input_1"}, "class_name": "InputLayer"}, {"config": {"W_regularizer": null, "init": "glorot_uniform", "subsample": [2, 2], "trainable": true, "b_regularizer": null, "activation": "relu", "name": "conv1", "W_constraint": null, "bias": true, "activity_regularizer": null, "dim_ordering": "tf", "nb_col": 3, "b_constraint": null, "border_mode": "valid", "nb_filter": 16, "nb_row": 3}, "class_name": "Convolution2D"}, {"config": {"W_regularizer": null, "init": "glorot_uniform", "subsample": [2, 2], "trainable": true, "b_regularizer": null, "activation": "relu", "name": "conv2", "W_constraint": null, "bias": true, "activity_regularizer": null, "dim_ordering": "tf", "nb_col": 3, "b_constraint": null, "border_mode": "valid", "nb_filter": 32, "nb_row": 3}, "class_name": "Convolution2D"}, {"config": {"W_regularizer": null, "init": "glorot_uniform", "subsample": [1, 1], "trainable": true, "b_regularizer": null, "activation": "relu", "name": "conv3", "W_constraint": null, "bias": true, "activity_regularizer": null, "dim_ordering": "tf", "nb_col": 5, "b_constraint": null, "border_mode": "valid", "nb_filter": 8, "nb_row": 5}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "pool_size": [4, 4], "dim_ordering": "tf", "border_mode": "valid", "name": "maxpool2", "strides": [4, 4]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"W_regularizer": null, "output_dim": 20, "b_regularizer": null, "activation": "sigmoid", "name": "dense20", "input_dim": 64, "init": "glorot_uniform", "bias": true, "activity_regularizer": null, "W_constraint": null, "trainable": true, "b_constraint": null}, "class_name": "Dense"}, {"config": {"p": 0.5, "trainable": true, "name": "dropout"}, "class_name": "Dropout"}, {"config": {"W_regularizer": null, "output_dim": 20, "b_regularizer": null, "activation": "sigmoid", "name": "dense10", "input_dim": 20, "init": "glorot_uniform", "bias": true, "activity_regularizer": null, "W_constraint": null, "trainable": true, "b_constraint": null}, "class_name": "Dense"}, {"config": {"W_regularizer": null, "output_dim": 1, "b_regularizer": null, "activation": "linear", "name": "final", "input_dim": 20, "init": "glorot_uniform", "bias": true, "activity_regularizer": null, "W_constraint": null, "trainable": true, "b_constraint": null}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.2.0"}