{"keras_version": "1.2.0", "config": [{"config": {"batch_input_shape": [null, 50, 160, 3], "sparse": false, "input_dtype": "float32", "name": "input_1"}, "class_name": "InputLayer"}, {"config": {"subsample": [2, 2], "W_regularizer": null, "nb_filter": 16, "W_constraint": null, "b_constraint": null, "trainable": true, "init": "glorot_uniform", "nb_col": 3, "nb_row": 3, "border_mode": "valid", "activity_regularizer": null, "dim_ordering": "tf", "b_regularizer": null, "activation": "relu", "name": "conv1", "bias": true}, "class_name": "Convolution2D"}, {"config": {"subsample": [2, 2], "W_regularizer": null, "nb_filter": 32, "W_constraint": null, "b_constraint": null, "trainable": true, "init": "glorot_uniform", "nb_col": 3, "nb_row": 3, "border_mode": "valid", "activity_regularizer": null, "dim_ordering": "tf", "b_regularizer": null, "activation": "relu", "name": "conv2", "bias": true}, "class_name": "Convolution2D"}, {"config": {"subsample": [1, 1], "W_regularizer": null, "nb_filter": 8, "W_constraint": null, "b_constraint": null, "trainable": true, "init": "glorot_uniform", "nb_col": 5, "nb_row": 5, "border_mode": "valid", "activity_regularizer": null, "dim_ordering": "tf", "b_regularizer": null, "activation": "relu", "name": "conv3", "bias": true}, "class_name": "Convolution2D"}, {"config": {"pool_size": [4, 4], "border_mode": "valid", "trainable": true, "dim_ordering": "tf", "name": "maxpool2", "strides": [4, 4]}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"W_regularizer": null, "batch_input_shape": [null, 64], "input_dim": 64, "W_constraint": null, "b_constraint": null, "trainable": true, "init": "glorot_uniform", "activity_regularizer": null, "name": "dense20", "b_regularizer": null, "activation": "sigmoid", "output_dim": 20, "input_dtype": "float32", "bias": true}, "class_name": "Dense"}, {"config": {"p": 0.5, "trainable": true, "name": "dropout"}, "class_name": "Dropout"}, {"config": {"W_regularizer": null, "batch_input_shape": [null, 20], "input_dim": 20, "W_constraint": null, "b_constraint": null, "trainable": true, "init": "glorot_uniform", "activity_regularizer": null, "name": "dense10", "b_regularizer": null, "activation": "sigmoid", "output_dim": 20, "input_dtype": "float32", "bias": true}, "class_name": "Dense"}, {"config": {"W_regularizer": null, "batch_input_shape": [null, 20], "input_dim": 20, "W_constraint": null, "b_constraint": null, "trainable": true, "init": "glorot_uniform", "activity_regularizer": null, "name": "final", "b_regularizer": null, "activation": "linear", "output_dim": 1, "input_dtype": "float32", "bias": true}, "class_name": "Dense"}], "class_name": "Sequential"}