{"config": [{"config": {"input_dtype": "float32", "batch_input_shape": [null, 45, 160, 3], "sparse": false, "name": "input_1"}, "class_name": "InputLayer"}, {"config": {"depthwise_constraint": null, "activation": "relu", "nb_row": 3, "nb_col": 3, "activity_regularizer": null, "pointwise_constraint": null, "trainable": true, "b_regularizer": null, "bias": true, "dim_ordering": "tf", "border_mode": "valid", "pointwise_regularizer": null, "depth_multiplier": 1, "subsample": [2, 2], "b_constraint": null, "nb_filter": 16, "init": "glorot_uniform", "depthwise_regularizer": null, "name": "conv1"}, "class_name": "SeparableConvolution2D"}, {"config": {"activation": "relu", "nb_row": 3, "nb_col": 3, "activity_regularizer": null, "trainable": true, "W_regularizer": null, "b_regularizer": null, "W_constraint": null, "dim_ordering": "tf", "border_mode": "valid", "subsample": [2, 2], "b_constraint": null, "nb_filter": 32, "init": "glorot_uniform", "bias": true, "name": "conv2"}, "class_name": "Convolution2D"}, {"config": {"activation": "relu", "nb_row": 5, "nb_col": 5, "activity_regularizer": null, "trainable": true, "W_regularizer": null, "b_regularizer": null, "W_constraint": null, "dim_ordering": "tf", "border_mode": "valid", "subsample": [1, 1], "b_constraint": null, "nb_filter": 8, "init": "glorot_uniform", "bias": true, "name": "conv3"}, "class_name": "Convolution2D"}, {"config": {"strides": [4, 4], "trainable": true, "border_mode": "valid", "pool_size": [4, 4], "dim_ordering": "tf", "name": "maxpool2"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"activation": "sigmoid", "b_constraint": null, "activity_regularizer": null, "trainable": true, "W_regularizer": null, "b_regularizer": null, "output_dim": 20, "W_constraint": null, "input_dim": 64, "init": "glorot_uniform", "bias": true, "name": "dense20"}, "class_name": "Dense"}, {"config": {"trainable": true, "p": 0.5, "name": "dropout"}, "class_name": "Dropout"}, {"config": {"activation": "sigmoid", "b_constraint": null, "activity_regularizer": null, "trainable": true, "W_regularizer": null, "b_regularizer": null, "output_dim": 20, "W_constraint": null, "input_dim": 20, "init": "glorot_uniform", "bias": true, "name": "dense10"}, "class_name": "Dense"}, {"config": {"activation": "linear", "b_constraint": null, "activity_regularizer": null, "trainable": true, "W_regularizer": null, "b_regularizer": null, "output_dim": 1, "W_constraint": null, "input_dim": 20, "init": "glorot_uniform", "bias": true, "name": "final"}, "class_name": "Dense"}], "keras_version": "1.2.0", "class_name": "Sequential"}