{"config": [{"config": {"name": "input_8", "input_dtype": "float32", "sparse": false, "batch_input_shape": [null, 80, 160, 3]}, "class_name": "InputLayer"}, {"config": {"depth_multiplier": 1, "depthwise_regularizer": null, "nb_col": 3, "border_mode": "valid", "nb_row": 3, "pointwise_constraint": null, "trainable": true, "nb_filter": 16, "activation": "relu", "depthwise_constraint": null, "activity_regularizer": null, "init": "glorot_uniform", "bias": true, "b_constraint": null, "subsample": [2, 2], "b_regularizer": null, "dim_ordering": "tf", "pointwise_regularizer": null, "name": "conv1"}, "class_name": "SeparableConvolution2D"}, {"config": {"name": "conv2", "nb_col": 3, "W_constraint": null, "border_mode": "valid", "nb_row": 3, "trainable": true, "nb_filter": 32, "activation": "relu", "activity_regularizer": null, "init": "glorot_uniform", "bias": true, "b_constraint": null, "subsample": [2, 2], "b_regularizer": null, "dim_ordering": "tf", "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"name": "conv3", "nb_col": 5, "W_constraint": null, "border_mode": "valid", "nb_row": 5, "trainable": true, "nb_filter": 64, "activation": "relu", "activity_regularizer": null, "init": "glorot_uniform", "bias": true, "b_constraint": null, "subsample": [1, 1], "b_regularizer": null, "dim_ordering": "tf", "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"border_mode": "valid", "strides": [4, 4], "pool_size": [4, 4], "name": "maxpool2", "dim_ordering": "tf", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_8", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "dense100", "W_constraint": null, "W_regularizer": null, "input_dim": 1536, "trainable": true, "activation": "sigmoid", "activity_regularizer": null, "output_dim": 100, "init": "glorot_uniform", "bias": true, "b_constraint": null, "b_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "dense20", "W_constraint": null, "W_regularizer": null, "input_dim": 100, "trainable": true, "activation": "sigmoid", "activity_regularizer": null, "output_dim": 20, "init": "glorot_uniform", "bias": true, "b_constraint": null, "b_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "dropout", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"name": "dense10", "W_constraint": null, "W_regularizer": null, "input_dim": 20, "trainable": true, "activation": "sigmoid", "activity_regularizer": null, "output_dim": 10, "init": "glorot_uniform", "bias": true, "b_constraint": null, "b_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "final", "W_constraint": null, "W_regularizer": null, "input_dim": 10, "trainable": true, "activation": "linear", "activity_regularizer": null, "output_dim": 1, "init": "glorot_uniform", "bias": true, "b_constraint": null, "b_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.2.0"}